<?php

return [
    'index' => [
        'title' => 'معرض الصور',
        'search_placeholder' => 'ابحث بالعنوان...',
        'add_new' => 'إضافة عنصر جديد',
        'empty' => 'لا توجد عناصر في المعرض حالياً.',
    ],

    'create' => [
        'title' => 'إضافة عنصر جديد للمعرض',
        'submit' => 'إضافة',
        'cancel' => 'إلغاء',
    ],

    'edit' => [
        'title' => 'تعديل بيانات العنصر',
        'submit' => 'حفظ التعديلات',
        'cancel' => 'إلغاء',
    ],

    'show' => [
        'title' => 'تفاصيل العنصر',
        'back' => 'رجوع',
    ],

    'fields' => [
        'title' => 'العنوان',
        'image' => 'الصورة',
        'created_at' => 'تاريخ الإضافة',
        'actions' => 'الإجراءات',
    ],

    'actions' => [
        'show' => 'عرض',
        'edit' => 'تعديل',
        'delete' => 'حذف',
        'preview' => 'معاينة',
        'back' => 'العودة للقائمة'
    ],

    'messages' => [
        'delete_confirmation' => 'هل أنت متأكد من رغبتك في حذف هذا العنصر؟',
        'created' => 'تمت الإضافة بنجاح.',
        'updated' => 'تم حفظ التعديلات بنجاح.',
        'deleted' => 'تم الحذف بنجاح.',
        'type' => 'يرجى رفع صورة بإحدى الصيغ التالية: (JPG, JPEG, PNG, WEBP).'
    ],
];
